import type { NextPage } from 'next'
import { Header } from '../components/Header'
import { Seo } from '../components/Seo'

const Home: NextPage = () => {
  return (
    <>
      <Seo />
      <Header />
      <div className='w-full h-64 bg-center bg-cover bg-[url(/images/pageCover.webp)]' />
      <main className='containered'>
        <h1 className='pt-16 text-6xl text-center sm:text-left text-h1 font-inter font-bold'>Максим Никонов</h1>
        <article className='mt-12 items-center flex gap-3 p-4 rounded-sm bg-[#F7F7F7]'>
          <div className="w-5 h-5">
            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M16.1111 6.14444C16.1111 9.72166 13.3334 10.2772 13.3334 13.6111C13.3334 15.3322 11.5984 15.4772 10.2778 15.4772C9.13725 15.4772 6.61892 15.0444 6.61892 13.61C6.61892 10.2778 3.88892 9.72222 3.88892 6.14444C3.88892 2.79389 6.82503 0.077774 10.0461 0.077774C13.2684 0.077774 16.1111 2.79389 16.1111 6.14444Z" fill="#FFD983"/>
              <path d="M12.3149 18.0556C12.3149 18.5156 11.0738 19.4444 9.99994 19.4444C8.92605 19.4444 7.68494 18.5156 7.68494 18.0556C7.68494 17.5956 8.92549 17.7778 9.99994 17.7778C11.0738 17.7778 12.3149 17.5956 12.3149 18.0556Z" fill="#CCD6DD"/>
              <path d="M12.615 5.71834C12.3977 5.50111 12.0466 5.50111 11.8294 5.71834L9.99996 7.54778L8.17052 5.71834C7.9533 5.50111 7.60218 5.50111 7.38496 5.71834C7.16774 5.93556 7.16774 6.28667 7.38496 6.50389L9.44441 8.56334V14.4444C9.44441 14.7517 9.6933 15 9.99996 15C10.3066 15 10.5555 14.7517 10.5555 14.4444V8.56334L12.615 6.50389C12.8322 6.28667 12.8322 5.93556 12.615 5.71834Z" fill="#FFCC4D"/>
              <path d="M13.3333 17.2222C13.3333 17.8356 12.8355 18.3333 12.2222 18.3333H7.77774C7.1644 18.3333 6.66663 17.8356 6.66663 17.2222V13.8889H13.3333V17.2222Z" fill="#99AAB5"/>
              <path d="M6.66611 17.7778C6.39944 17.7778 6.16388 17.585 6.11888 17.3133C6.06833 17.0111 6.27277 16.7244 6.57555 16.6744L13.2422 15.5633C13.5444 15.5089 13.8311 15.7172 13.8811 16.02C13.9317 16.3222 13.7272 16.6089 13.4244 16.6589L6.75777 17.77C6.72722 17.7756 6.69611 17.7778 6.66611 17.7778ZM6.66611 15.5556C6.39944 15.5556 6.16388 15.3628 6.11888 15.0911C6.06833 14.7889 6.27277 14.5022 6.57555 14.4522L13.2422 13.3411C13.5444 13.2872 13.8311 13.495 13.8811 13.7978C13.9317 14.1 13.7272 14.3867 13.4244 14.4367L6.75777 15.5478C6.72722 15.5533 6.69611 15.5556 6.66611 15.5556Z" fill="#CCD6DD"/>
            </svg>
          </div>
          <p>Это сайт-портфолио, блог и резюме. Ниже указаны все разделы сайта</p>
        </article>
        <section>
          <h2 className='text-3xl mb-2 mt-8 text-h2 font-bold'>Обо мне</h2>
          <p>Привет, меня зовут - Максим и я Front-End разработчик Мне сейчас 20 лет. Я занимаюсь программированием и веб-дизайном.</p>
        </section>
        <section>
          <h2 className='text-3xl mb-2 mt-8 text-h2 font-bold'>Об этом сайте</h2>
          <p>+/- 100% в Google Lighthouse</p>
        </section>
      </main>
    </>
  )
}

export default Home
